In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({'name': ['a', 'b'], 'class': [8, 9]})
df

  name  class
0    a      8
1    b      9

In [3]:
df.loc[2, :] = 89
df

  name  class
0    a    8.0
1    b    9.0
2   89   89.0

In [4]:
df.loc[:, 'section'] = ['a', 'b', 'a']
df

  name  class section
0    a    8.0       a
1    b    9.0       b
2   89   89.0       a

In [5]:
df.name = df.name.astype('str')

In [6]:
df.name.dtype

dtype('O')

In [7]:
df.loc[:, 'nameLen'] = df.name.str.len()
df

  name  class section  nameLen
0    a    8.0       a        1
1    b    9.0       b        1
2   89   89.0       a        2

In [8]:
df.insert(1, 'newCol', 99)

In [9]:
df

  name  newCol  class section  nameLen
0    a      99    8.0       a        1
1    b      99    9.0       b        1
2   89      99   89.0       a        2

In [11]:
df.insert(1, 'newCol', 100, allow_duplicates = True)
df

  name  newCol  newCol  class section  nameLen
0    a     100      99    8.0       a        1
1    b     100      99    9.0       b        1
2   89     100      99   89.0       a        2

In [12]:
df.loc[[0, 2], 'nameLen'] = [3, 4]
df

  name  newCol  newCol  class section  nameLen
0    a     100      99    8.0       a        3
1    b     100      99    9.0       b        1
2   89     100      99   89.0       a        4

In [20]:
df.drop([0, 1], axis = 0)

  name  newCol  newCol  class section  nameLen
2   89     100      99   89.0       a        4

In [21]:
df.iloc[:2, 1] = None
df

  name  newCol  newCol  class section  nameLen
0    a     NaN      99    8.0       a        3
1    b     NaN      99    9.0       b        1
2   89   100.0      99   89.0       a        4

In [23]:
del df['name']

In [24]:
df

   newCol  newCol  class section  nameLen
0     NaN      99    8.0       a        3
1     NaN      99    9.0       b        1
2   100.0      99   89.0       a        4

In [25]:
df.isna()

   newCol  newCol  class  section  nameLen
0    True   False  False    False    False
1    True   False  False    False    False
2   False   False  False    False    False

In [27]:
df.isna().any().any()

True

In [31]:
df.isna().sum()

newCol     2
newCol     0
class      0
section    0
nameLen    0
dtype: int64

In [35]:
df.dropna(axis = 1, how = 'any')

   newCol  class section  nameLen
0      99    8.0       a        3
1      99    9.0       b        1
2      99   89.0       a        4

In [42]:
df.fillna(pd.DataFrame([89, 99], columns = ['newCol']))

InvalidIndexError:

In [43]:
pd.DataFrame([89, 99], columns = ['newCol'])

   newCol
0      89
1      99

In [44]:
df

   newCol  newCol  class section  nameLen
0     NaN      99    8.0       a        3
1     NaN      99    9.0       b        1
2   100.0      99   89.0       a        4

In [45]:
df.fillna(0, inplace = True)
df

   newCol  newCol  class section  nameLen
0     0.0      99    8.0       a        3
1     0.0      99    9.0       b        1
2   100.0      99   89.0       a        4

In [46]:
df.loc[3] = df.loc[2]
df

   newCol  newCol  class section  nameLen
0     0.0      99    8.0       a        3
1     0.0      99    9.0       b        1
2   100.0      99   89.0       a        4
3   100.0      99   89.0       a        4

In [47]:
df.duplicated()

0    False
1    False
2    False
3     True
dtype: bool

In [48]:
df.drop_duplicates()

   newCol  newCol  class section  nameLen
0     0.0      99    8.0       a        3
1     0.0      99    9.0       b        1
2   100.0      99   89.0       a        4

In [51]:
df.loc[:, 'newCols'] = df.loc[:, 'class']
df

   newCol  newCol  class section  nameLen  newCols
0     0.0      99    8.0       a        3      8.0
1     0.0      99    9.0       b        1      9.0
2   100.0      99   89.0       a        4     89.0
3   100.0      99   89.0       a        4     89.0

In [52]:
df.duplicated()

0    False
1    False
2    False
3     True
dtype: bool

In [55]:
df.drop_duplicates(keep = 'last', ignore_index = True)

   newCol  newCol  class section  nameLen  newCols
0     0.0      99    8.0       a        3      8.0
1     0.0      99    9.0       b        1      9.0
2   100.0      99   89.0       a        4     89.0

In [59]:
df['class'].unique()

array([ 8.,  9., 89.])

In [60]:
df.section.unique()

array(['a', 'b'], dtype=object)

In [61]:
df.section.value_counts()

section
a    3
b    1
Name: count, dtype: int64